<?php

return [
    'singular' => 'المنشور',
    'plural' => 'المنشورات',
    'empty' => 'لا يوجد منشورات.',
    'count' => 'عدد المنشورات',
    'search' => 'بحث',
    'select' => 'اختر المنشور',
    'perPage' => 'عدد النتائج بالصفحة',
    'filter' => 'ابحث عن منشور',
    'actions' => [
        'list' => 'عرض الكل',
        'create' => 'اضافة منشور',
        'show' => 'عرض المنشور',
        'edit' => 'تعديل المنشور',
        'delete' => 'حذف المنشور',
        'options' => 'خيارات',
        'save' => 'حفظ',
        'filter' => 'بحث',
    ],
    'messages' => [
        'created' => 'تم اضافة المنشور بنجاح.',
        'updated' => 'تم تعديل المنشور بنجاح.',
        'deleted' => 'تم حذف المنشور بنجاح.',
        'images_note' => 'الملفات المدعومة: jpeg ، png ، jpg | الحد الأقصى لحجم الملف: 10 ميجا بايت',
    ],
    'attributes' => [
        'tilte' => 'اسم المنشور',
        'auther' => 'منشيء المنشور',
        'empty' => 'لا يوجد بيانات',
        'content' => 'محتوى المنشور',
        'image' => 'صورة المنشور',
    ],
    'dialogs' => [
        'delete' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد حذف المنشور ؟',
            'confirm' => 'حذف',
            'cancel' => 'الغاء',
        ],
    ],
];
