<?php

return [
    'singular'   => 'المحادثة',
    'plural'     => 'المحادثات',
    'empty'      => 'لا يوجد محادثات.',
    'count'      => 'عدد المحادثات',
    'search'     => 'بحث',
    'select'     => 'اختر المحادثة',
    'perPage'    => 'عدد النتائج بالصفحة',
    'filter'     => 'ابحث عن محادثة',
    'actions'    => [
        'list'    => 'عرض الكل',
        'create'  => 'اضافة محادثة',
        'show'    => 'عرض المحادثة',
        'edit'    => 'تعديل المحادثة',
        'delete'  => 'حذف المحادثة',
        'options' => 'خيارات',
        'save'    => 'حفظ',
        'filter'  => 'بحث',
    ],
    'messages'   => [
        'created'     => 'تم اضافة المحادثة بنجاح.',
        'updated'     => 'تم تعديل المحادثة بنجاح.',
        'deleted'     => 'تم حذف المحادثة بنجاح.',
        'images_note' => 'الملفات المدعومة: jpeg ، png ، jpg | الحد الأقصى لحجم الملف: 10 ميجا بايت',
    ],
    'attributes' => [
        'name'      => 'اسم المحادثة',
        '%name%'    => 'اسم المحادثة',
        'empty'     => 'لا يوجد بيانات',
        'content'   => 'محتوى المحادثة',
        '%content%' => 'محتوى المحادثة',
        'image'     => 'صورة المحادثة',
    ],
    'dialogs'    => [
        'delete' => [
            'title'   => 'تحذير !',
            'info'    => 'هل انت متأكد انك تريد حذف المحادثة ؟',
            'confirm' => 'حذف',
            'cancel'  => 'الغاء',
        ],
    ],
];
